In [18]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [19]:
df['FlightNumber'] = df['FlightNumber'].fillna(value=0)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           0.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           0.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [20]:
df =  df.astype({'FlightNumber':int})

In [21]:
df['FlightNumber'] = range(10045,10045+((len(df)*10)),10)
print(df)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [22]:
temp_df = pd.DataFrame(df['From_To'])
temp_df[['From','To']]=temp_df.From_To.str.split("_",expand=True,)
temp_df['From'] =temp_df['From'].str.capitalize() 
temp_df['To'] = temp_df['To'].str.capitalize()
temp_df

            From_To      From         To
0      LoNDon_paris    London      Paris
1      MAdrid_miLAN    Madrid      Milan
2  londON_StockhOlm    London  Stockholm
3    Budapest_PaRis  Budapest      Paris
4   Brussels_londOn  Brussels     London

In [23]:
df = pd.merge(temp_df,df, on='From_To', how='left')

In [24]:
df= df.drop('From_To',axis=1)

In [25]:
delays = df['RecentDelays'].apply(pd.Series)
delays = delays.rename(columns = lambda x : 'delay_' + str(x+1))
delays

   delay_1  delay_2  delay_3
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

In [26]:
result = pd.concat([df,delays], axis=1, sort=False)
result= result.drop('RecentDelays',axis=1)
result

,From,To,FlightNumber,Airline,delay_1,delay_2,delay_3
0,London,Paris,10045,KLM(!),23.0,47.0,NaN
1,Madrid,Milan,10055,<Air France> (12),NaN,NaN,NaN
2,London,Stockholm,10065,(British Airways. ),24.0,43.0,87.0
3,Budapest,Paris,10075,12. Air France,13.0,NaN,NaN
4,Brussels,London,10085,"""Swiss Air""",67.0,32.0,NaN